{
    "bk": "1947",
    "description": "Mechanical Engineering major with a concentration in Micro and Nanotechnology from Mission Viejo, California. Enjoy the adventure of life and have traveled to numerous countries across Europe and the south Pacific. Soccer player, scuba diver, sky diver, cross country runner, rock climber, wakeboarder, surfer, and generally anything having to do with extreme sports or water.",
    "aspects": "The absolute best thing about being a Lambda Chi is having one of the best and biggest brotherhoods on campus. There are guys I can spend all day rock climbing with yet when we need to get work done I know I have some of the smartest guys at Tech to call on. They are always there for me and always push me to try new things and go enjoy the adventures of life. I know that without them I definitely would not be having as amazing of a college experience as I am now.",
    "positions": [
     ],
    "year": "Class of 2016",
    "major":  "Mechanical Engineering",
    "involve": [
        "Ramblin Wreck Club",
        "Wreckless Advertising Committee",
        "Pacific Study Abroad Program 2014",
        "Invention Studio",
        "Freshman Council"
    ],
    "interests": [
        "Soccer player", 
        "Scuba diver", 
        "Sky diver", 
        "Cross country runner",
        "Rock climber",
        "Wakeboarder", 
        "Surfer", 
        "Generally anything having to do with extreme sports or water", 
        "Love to cook",
        "Love to learn new languages",
        "Love to wander Atlanta finding its hidden gems"
    ],
    "sports": [
        "Soccer",
        "Cross-country",
        "Surfing",
        "Volleyball",
        "Skiing",
        "Wakeboarding",
        "Scuba"
    ],
    "quotes" : [
        "\"Well it wasn't supposed to do that but hell at least it works!\""
    ],


    "id": "charliehanzel",
    "images": [
        "img/brothers/hanzel.0.jpg",
        "img/brothers/hanzel.1.jpg",
        "img/brothers/hanzel.2.jpg",
        "img/brothers/hanzel.3.jpg"
    ],
    "name": "Charlie Hanzel"
}