{
    "bk": "1883",
    "description": "What up, my name is Jake Amsbaugh and I am 3rd year at Georgia Tech. I am currently an Industrial Systems Engineering major, minoring in Technology & Management. My current career goal is to become an administrator an a prominent Atlanta-based company. I want to oversee foreign expansion of business and industry, preferably in the far east. I love deep sea fishing, hiking, dirt bike riding, skiing and pretty much any activity that is outdoors. I also am a huge fan of Game of Thrones, Starwars, South Park, and Lord of the Rings. Currently, I am working at the esteemed eating establishment of Chili's Bar and Grille. (It's a pretty rachet job but it pays the bills.) Other than that I love hanging with my bros, traveling the world, and getting involved on campus.",
    "aspects": "My favorite part about Lambda Chi are the great connections/friendships that I have made and furthermore the opportunities that have arisen from the relationships. I could have never imagined that I would associate myself with such a group of diverse and highly motivated individuals. This fraternity has been a fantastic resources for me in college from getting involved on campus, excelling in academics and becoming better suited for the working world. From the worst of times to the best of times, the guys in Lambda Chi have always had my back and have definitely influenced me to strive for my goals and helped me grow into a better man.",
    "positions": [
     "Rush Committee, 2012-2013"
     ],
    "year": "Class of 2015",
    "major":  "Industrial Engineering",
    "involve": [
        "Georgia Tech Lorraine Study Abroad, 2013",
        "Inter-Fraternity Judicial Board, 2012",
        "Denning Technology and Management",
        "Connect with Tech",
        "Eye to Eye LD/ADHD Mentoring Program"
    ],
    "interests": [
        "Chilling", 
        "Watching movies",
        "Hiking",
        "Skiing", 
        "Traveling",
        "Swimming",
        "Laxing", 
        "Redding",
        "Learning anything about science",
        "Debating politics/philosophy",
        "Dirt bike riding",
        "Boating",
        "Shooting the hooch",
        "Trying new foods",
        "Working"
    ],
    "sports": [
        "Lacrosse",
        "Swimming",
        "Bro-ing"
    ],
    "quotes" : [
        "\"Party hard, and Study Harder\""
    ],


    "id": "jakeamsbaugh",
    "images": [
        "img/brothers/amsbaugh.0.jpg",
        "img/brothers/amsbaugh.1.jpg",
        "img/brothers/amsbaugh.2.jpg"
    ],
    "name": "Jake Amsbaugh"
}