{
    "bk": "1868",
    "description": "Most people know me as Sweetbutta. Those who don't know me have only heard the tales of the great and mysterious Sweebutta, and hope beyond hope to meet this legendary figure someday. BME major/Biology minor serving my 5 years at this Institution. Fall '10 AM class. From Tallahassee, Florida. Love America and love the South. Will be making a run for the Presidency in 2028, and I would appreciate your vote.",
    "aspects": "Lambda Chi Alpha is about creating lasting, life-long relationships with an awesome group of guys, and filling your college years with unforgettable memories. I honestly cannot imagine how I would've made it this far without the support of my fraternity brothers and the plethora of resources and opportunities this fraternity provides. Some of my favorite aspects of Lambda Chi include, but are definitely not limited to, Formal/Semiformal, Gamedays, Magic Carpet Ride, Gamedays, Chef Jon's hotfire chicken fings, Gamedays, Mason the puppy, Brotherhood Retreat, and, of course, Gamedays. There is no other experience that compares to being a brother in this fraternity. When I graduate I will be able to look back on my time at Tech and say, \"Yeah. I did it right.\"",
    "positions": [
        "High Gamma: Secretary, 2014"
     ],
    "year": "Class of 2014",
    "major":  "Public Policy/Business Administration - Finance",
    "involve": [
        "Freshman Activities Board (FAB)",
        "Engineering World Health",
        "GT College Republicans",
        "Army ROTC",
        "REScour LLC Senior Vice President of Research and Development",
        "Beta Kappa Academic Success Program Mentor"
    ],
    "interests": [
       "Working Out",
       "Eating",
       "America",
       "Cars and Motorcycles"
    ],
    "sports": [
        "Football",
        "Soccer",
        "Baseball - pre-ACL surgery",
        "Drinking and watching other people play sports - post-ACL surgery"
    ],
    "quotes" : [
        "\"Everybody wanna be a bodybuilder, but don't nobody wanna lift no heavy-ass weights.\" - Ronnie Coleman"
    ],


    "id": "mattbrooks",
    "images": [
        "img/brothers/brooks.0.jpg"
    ],
    "name": "Matt Brooks"
}
