{
    "bk": "1923",
    "description": "American by birth, Southern by the grace of God. Will tries to take advantage of anything life throws his way. From solo backpacking through Europe to inventing a brand new baby pacifier to running with the bulls, Will is hoping these experiences and experiences to come will continue to grow him and to one day land him in a top med school.",
    "aspects": "Being a part of Lambda Chi has opened up many opportunities that I would have never had if I went anywhere else. Almost everything I do at Georgia Tech and elsewhere is due to connections that I have made through Lambda Chi and through the involvements of the rest of my brothers. We are a diverse fraternity, not only in the types of guys that join, but also in our beliefs and experiences. This diversity has allowed me to broaden my view on the world and allowed me to connect with people the world over.",
    "positions": [
    "High Rho : Alumni Relations Chairmen, 2014"
     ],
    "year": "Class of 2016",
    "major":  "Biomedical Engineering, Pre-Med",

    "involve": [
        "Oxford Study Abroad, 2014",
        "Biomedical Engineering Student Advisory Board",
        "Presidents' Council Governing Board, Vice Chair of Finance",
        "BMED 1000 Mentor",
        "Freshman Activities Board, Sophomore Advisor",
        "Georgia Tech Executive Round Table",
        "IFC Social Committee",
        "American Medical Students Association"
    ],
    "interests": [
        "Life, Liberty, and the Pursuit of Happiness"
    ],
    "sports": [
        "SPORTSSS", 
        "Baseball", 
        "Crew"
    ],
    "quotes" : [
       "\"Once you eliminate the impossible, whatever remains, no matter how improbable, must be the truth.\" -Sir Arthur Conan Doyle",
       "\"I can't, I have a BME meeting\"",
       "\"No it's not a pre-tied bowtie.\""
    ],


    "id": "willmcallister",
    "images": [
        "img/brothers/mcallister.0.jpg",
        "img/brothers/mcallister.1.jpg",
        "img/brothers/mcallister.2.jpg"
    ],
    "name": "Will McAllister"
}